app/controllers/answers_controller.rb

  def new
    @answer = Answer.new
    @question = Question.find(params[:question_id])
---
SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = $1  ORDER BY created_at DESC LIMIT 1  [["id", 1]]

  def create
    @question = find_question
    @answer = current_user.answers.create(body: params[:answer][:body],
                                          question_id: @question.id)
---
INSERT INTO "answers" ("body", "created_at", "question_id", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "Here is an answer"], ["created_at", "2015-02-11 06:46:43.660408"], ["question_id", 1], ["updated_at", "2015-02-11 06:46:43.660408"], ["user_id", 1]]