app/controllers/questions_controller.rb

  def index
    @questions = Question.all
---
SELECT "questions".* FROM "questions"   ORDER BY created_at DESC

  def show
    @question = Question.find(params[:id])
---
SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = $1  ORDER BY created_at DESC LIMIT 1  [["id", 3]]

  def edit
    @question = Question.find(params[:id])
---
SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = $1  ORDER BY created_at DESC LIMIT 1  [["id", 3]]

  def update
    @question = Question.find(params[:id])

    if @question.update(question_params)
---
SELECT  "questions".* FROM "questions"  WHERE "questions"."id" = $1  ORDER BY created_at DESC LIMIT 1  [["id", 3]]
UPDATE "questions" SET "body" = $1, "updated_at" = $2 WHERE "questions"."id" = 3  [["body", "asdasdasdasdasdasd123123123123"], ["updated_at", "2014-08-11 13:50:17.598419"]]

  def create
    # Using current_user and #create/#build to add a question
    # to the current user's array of questions
    @question = current_user.questions.create(question_params)
---
INSERT INTO "questions" ("body", "created_at", "title", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "This is the body to the question"], ["created_at", "2015-02-11 06:46:30.248098"], ["title", "This is a question"], ["updated_at", "2015-02-11 06:46:30.248098"], ["user_id", 1]]